Revit 2027 API
FamilyHostingBehavior Enumeration
 Types of hosts into/onto which a family can be hosted. For informative purposes only. Does not affect anything in Revit!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FamilyHostingBehavior
Public Enumeration FamilyHostingBehavior
public enum class FamilyHostingBehavior
type FamilyHostingBehavior
Members
Member name | Value | Description
Ceiling | 3
Face | 5
Floor | 2
None | 0
Roof | 4
Wall | 1
See Also
Reference
Autodesk.Revit.DB Namespace